import java.util.ArrayList;
import java.util.List;

public class DeckModel {

    // Не понятно почему именно static, и для чего. Не вижу в этом никакого слысла.
    // Почитай что такое static и зачем он нужен.
    // Нейминг: я бы назвал переменную cardsList - оно идельно описывает что это за переменная.


    // Какая-то пустоваятая модель колоды, не кажется?)
    // Колода - это уровень абстрации, поле deckModel у тебя приватное, никто к нему доступ из вне не имеет. И это правильно.
    // Но тогда должны быть методы работы с колодой. Подумай нед тем, какие опреации мы можем с колодой совершать.
    // Напиши для начала имя функции без реализации, это называется "декомпозиция".
    // Пример:
    // public void addCard(CardModel card) {
    //    // TODO: Add card to the deck
    // }
    // Придумай все, что можно сделать с колодой и опиши в таком виде.

        // Не понятно почему именно static, и для чего. Не вижу в этом никакого слысла.
        // Почитай что такое static и зачем он нужен.
        // Нейминг: я бы назвал переменную cardsList - оно идельно описывает что это за переменная.
        private List<CardModel> cardsList;
public DeckModel get(){}

        public void remove(){


        }



    }


